/*------------------------------------------------------------------------------------
 1 테이블명		: TB_STREAK
 2 기능 및 설명	: 스트릭 테이블
 3 관련 스토어드	: SP_STREAK

	DROP TABLE TB_STREAK;
	DROP INDEX IX1_STREAK;
	SELECT * FROM TB_STREAK;
------------------------------------------------------------------------------------*/
CREATE TABLE TB_STREAK
(
    user_id			NUMBER			NOT NULL,		-- 유저 번호
    streak_date		DATE			NOT NULL,		-- 날짜
    point			NUMBER			NOT NULL		-- 획득 포인트
);

------------------------------------------------------------------------------------
--  Constraints for Table TB_FRIEND
------------------------------------------------------------------------------------
ALTER TABLE TB_STREAK ADD CONSTRAINT PK_STREAK PRIMARY KEY(user_id, streak_date);

/*------------------------------------------------------------------------------------
	END
------------------------------------------------------------------------------------*/